<a href="https://colab.research.google.com/github/fkvldjtm/LGMRepo/blob/master/python_pandas_exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.5'

In [3]:
#pd.show_versions()

drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$','').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks',parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

In [4]:
df = pd.DataFrame({'col one':[100,200], 'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

In [5]:
pd.DataFrame(np.random.rand(4,8))

          0         1         2  ...         5         6         7
0  0.989359  0.467999  0.460342  ...  0.931578  0.691571  0.677092
1  0.826427  0.238235  0.018157  ...  0.341383  0.244834  0.198627
2  0.245205  0.625681  0.867044  ...  0.580502  0.753733  0.171156
3  0.050096  0.066957  0.962476  ...  0.246636  0.767203  0.176909

[4 rows x 8 columns]

In [6]:
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

          a         b         c  ...         f         g         h
0  0.018406  0.356622  0.458803  ...  0.077866  0.167445  0.077177
1  0.689737  0.997312  0.286219  ...  0.075346  0.089169  0.164810
2  0.474442  0.351988  0.976094  ...  0.977105  0.047011  0.847561
3  0.247066  0.508289  0.470671  ...  0.156203  0.793419  0.446290

[4 rows x 8 columns]

In [7]:
df

   col one  col two
0      100      300
1      200      400

In [8]:
# Column 이름을 바꾸기 위한 첫 번째 방법
#df = df.rename({'col one':'col_one','col tow':'col_two'}, axis='columns')

In [9]:
df

   col one  col two
0      100      300
1      200      400

In [10]:
# Column 이름을 바꾸기 위한 두 번째 방법
#df.columns = {'col_one','col_two'}

In [11]:
df

   col one  col two
0      100      300
1      200      400

In [12]:
# Column 이름을 바꾸기 위한 세 번째 방법
df.columns = df.columns.str.replace(' ','_')

In [13]:
df

   col_one  col_two
0      100      300
1      200      400

In [14]:
# Column 이름을 바꾸기 위한 네 번째 방법
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [15]:
# Column 이름을 바꾸기 위한 다섯 번째 방법
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

In [16]:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [17]:
# 역순서 입력시 [::-1]입력
# 열 순서를 뒤집고 싶으면 [:,::-1] 입력
drinks.loc[::-1].head()

       country  beer_servings  ...  total_litres_of_pure_alcohol      continent
192   Zimbabwe             64  ...                           4.7         Africa
191     Zambia             32  ...                           2.5         Africa
190      Yemen              6  ...                           0.1           Asia
189    Vietnam            111  ...                           2.0           Asia
188  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [18]:
drinks.loc[::-1].reset_index(drop=True).head()

     country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0   Zimbabwe             64  ...                           4.7         Africa
1     Zambia             32  ...                           2.5         Africa
2      Yemen              6  ...                           0.1           Asia
3    Vietnam            111  ...                           2.0           Asia
4  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [19]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [20]:
# 데이터 타입이 숫자형인 것 출력
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [21]:
# 데이터 타입이 객체?형인 것 출력
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [22]:
# 해당 데이터 타입 출력
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [23]:
# 숫자형 타입을 제외한 나머지 출력
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [24]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [25]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [26]:
# 데이터 타입을 숫자형으로 바꾼다.
# 'col_three'의 경우 index=2에 '-' 문자가 들어가 있어서 변경이 불가능하다. (에러 발생) 
df.astype({'col_one':'float', 'col_two':'float'}).dtypes
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [27]:
# 위와 같은 문제가 있을 경우 to_numeric을 이용해서 변경한다.
# errors 옵션에 'coerce'를 사용하면 'NaN'으로 들어감
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [28]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [29]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [30]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

In [ ]:
#Reduece DataFrame size

In [34]:
drinks

         country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0    Afghanistan              0  ...                           0.0           Asia
1        Albania             89  ...                           4.9         Europe
2        Algeria             25  ...                           0.7         Africa
3        Andorra            245  ...                          12.4         Europe
4         Angola            217  ...                           5.9         Africa
..           ...            ...  ...                           ...            ...
188    Venezuela            333  ...                           7.7  South America
189      Vietnam            111  ...                           2.0           Asia
190        Yemen              6  ...                           0.1           Asia
191       Zambia             32  ...                           2.5         Africa
192     Zimbabwe             64  ...                           4.7         Africa

[193 rows x 6 columns]

In [31]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [37]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry',usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   country        193 non-null    object
 1   beer_servings  193 non-null    int64
 2   continent      193 non-null    object
dtypes: int64(1), object(2)
memory usage: 26.0 KB

In [40]:
# "Asia", "Europe" 이렇게 카테고리로 묶을 수 있는 것은 데이터 타입을 카테고리고 바꾸면 용량을 많이 줄일 수 있음
# Country처럼 카테고리로 묶는게 비효율적인 것을 카테고리로 묶으면 오히려 용량이 증가함
# 또한 int64 인것을 int8 또는 int16 이런식으로 줄여서 데이터 메모리량을 줄일 수 있음.
dtypes = {'continent':'category'}
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry',usecols=cols, dtype=dtypes)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   country        193 non-null    object
 1   beer_servings  193 non-null    int64
 2   continent      193 non-null    category
dtypes: category(1), int64(1), object(1)
memory usage: 14.7 KB